// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let user = prompt('Введіть перше число');
// let number = prompt('Введіть друге число');
// if (user > number) {
//     alert('перше число більше');
// } else if (user < number) {
//     alert('друге число Більше');
// } else if (user === number) {
//     alert('числа рівні');
// }


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let entrance = Math.random() * 90;
// if (entrance >= 1 && entrance <= 20) {
//     alert('у першому підїзді');
// } else if (entrance >= 21 && entrance <= 48) {
//     alert('У другому');
// } else if (entrance >= 49 && entrance <= 90) {
//     alert('У третьому');
// }
// console.log(entrance)


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = prompt('Введіть число')
// if (number === '10')
// {
//     alert('Вірно');
// } else
// {
//     alert('Не вірно');
// }


// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let type = +prompt('Введіть любе значення');
//   if (typeof(type) === 'number') {
//       alert('1');
//   } else if (typeof(type) === 'string') {
//       alert('2');
//   } else if (typeof  type === 'object') {
//       alert('3');
//   } else if (typeof type === 'boolean') {
//       alert('3');
//   } else {
//       alert('Щось інше');
//   }


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temp = +prompt('Введіть температуру');
// if (temp >= 10 && temp <= 22) {
//     alert('сьогодні буде навчання');
// } else {
//     alert('Сидимо в дома');
// }


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .


let victorine = +prompt('введіть число від 1 до 5');
switch (victorine){
    case 1:
        alert('Вітаю ви виграли підзатильник');
        break;
    case 2:
        alert('Ви виграли особливе одне заняття на професії уборщик');
        break;
    case 3:
        alert('Ура ви виграли знижку 2% на всі товари в Епіцентр');
        break;
    case 4:
        alert('Ви виграли нову кредитну карту ПриватБанк всього лиш з 400% річних на перший кредит');
        break;
    case 5:
        alert('Ви виграли безкоштовну вакцинацію в самій елітній Лікарні села Мостиська');
        break;
    default:
        alert('Число не вірне, зато приїхав Українець у Францію заходить в ресторан, дістає сало і кличе офіціанта, офіціант підходить і Українець каже паріж. Так і появився Паріж');
        break;
}
