// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = Math.random() * 59;
// if (time >=0 && time <=14) {
//     console.log('перша');
// }
// else if (time >=15 && time <=29) {
//     console.log('друга')
// }
// else if (time >=30 && time <=44) {
//     console.log('третя')
// }
// else if (time >=45 && time <=59) {
//     console.log('четверта')
// }


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = Math.random() * 31;
// if (day >=1 && day <=11) {
//     console.log('у першу')
// }
// else if (day >= 12 && day <=21){
//     console.log('У другу')
// }
// else if (day >= 22 && day <=31){
//     console.log('У третю')
// }
// else if (day >= 0) {
//     console.log('не потрапляє')
// }


// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = +prompt('введіть число від 1 до 10');
// if (test <= 10) {
//     console.log(true);
// }
// else {
//     console.log(false);
// }
//
// //тернарка
// (test <= 10) ? console.log(true) : console.log(false)


// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = +prompt('Введіть 1 або 0, -3')
// if (a === 0) {
//     console.log(true)
// } else {
//     console.log(false)
// }
// //Тернарка
// (a === 0) ? console.log(true) : console.log(false);


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let myWeek = prompt('Введіть день від 1 до 7');
// switch (myWeek) {
//     case '1':
//         console.log('Робота + вечірні заняття');
//         break;
//     case '2':
//         console.log('Піти в зал + Практичні заняття');
//         break;
//     case '3':
//         console.log('Домашнє завдання + Англійська');
//         break;
//     case '4':
//         console.log('Робота + вечірні заняття');
//         break;
//     case '5':
//         console.log('Зал + Лекція');
//         break;
//     case '6':
//         console.log('Домашні завдання + відпочинок');
//         break;
//     case '7':
//         console.log('Бухати');
//         break
// }


// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

//
// let year = prompt('Введіть скільки днів у році');
// if (year % 4 === 0) {
//     console.log('Рік Високосний');
// } else {
//     console.log('Не Високосний');
// }

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!


// let question = prompt('Яка «офіційна» назва JavaScript?');
// if (question === 'ECMAScript') {
//     alert('Правильно');
// } else {
//     alert('Не знаєте? ECMAScript!');
// }