// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 3) {
//     alert('це великий масив')
// }
// else {
//     alert('Це маленький масив')
// }


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.


// let a = +prompt('Введіть число a')
// let b = +prompt('Введіть число b')
// let c = +prompt('Введіть число c')
// if((b<a && a<c) || (c<a && a<b)) alert(a);
// if((a<b && b<c) || (c<b && b<a)) alert(b);
// if((a<c && c<b) || (b<c && c<a)) alert(c);


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let a = 1
// let b = 4
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
// console.log(result)
//
// result = a + b < 4 ? 'Мало' : 'Багато';
// console.log(result)


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let number = +prompt('Введіть від -100 до 100')
// number < 0  ? console.log('Негативне') : number === 0 ? console.log('нуль') : console.log('позитивне');
